# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Programming\PSoC\GitGoalKitchen\Goal\GOAL-MASTER.cydsn\GOAL-MASTER.cyprj
# Date: Sun, 24 Feb 2019 14:00:12 GMT
#set_units -time ns
create_clock -name {ADC_ModClk(FFB)} -period 10625 -waveform {0 5312.5} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {I2C_Master_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {UART_SCBCLK(FFB)} -period 708.33333333333326 -waveform {0 354.166666666667} [list [get_pins {ClockBlock/ff_div_1}]]
create_clock -name {Clock_Servo(FFB)} -period 500000 -waveform {0 250000} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {Clock_Buzzer(FFB)} -period 2624666.6666666665 -waveform {0 1312333.33333333} [list [get_pins {ClockBlock/ff_div_4}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_ModClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]
create_generated_clock -name {I2C_Master_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 15 31} [list]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 17 35} -nominal_period 708.33333333333326 [list]
create_generated_clock -name {Clock_Servo} -source [get_pins {ClockBlock/hfclk}] -edges {1 12001 24001} [list]
create_generated_clock -name {Clock_Buzzer} -source [get_pins {ClockBlock/hfclk}] -edges {1 62993 125985} -nominal_period 2624666.6666666665 [list]


# Component constraints for D:\Programming\PSoC\GitGoalKitchen\Goal\GOAL-MASTER.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Programming\PSoC\GitGoalKitchen\Goal\GOAL-MASTER.cydsn\GOAL-MASTER.cyprj
# Date: Sun, 24 Feb 2019 14:00:06 GMT
